In [14]:
#Create Series Object 
series2 = pd.Series([1, 2, 3, 4, 5, 6], index = pd.date_range('20190102', periods=6))

In [15]:
#Display Series
series2

2019-01-02    1
2019-01-03    2
2019-01-04    3
2019-01-05    4
2019-01-06    5
2019-01-07    6
Freq: D, dtype: int64

In [11]:
#Set a new column labeled F with the values contained in series2

data_frame['F'] = series2

In [16]:
#Set row1 value in column A to equal zero
data_frame.at[dates[0], 'A'] =0

In [17]:
#Set value in row 1, column 2 to zero
data_frame.iat[0,1] = 0

In [18]:
#Set all rows in column D to numpy array 5*len(data_frame)
data_frame.loc[:, 'D'] = np.array([5]*len(data_frame))

In [19]:
#Display DataFrame
data_frame

                   A         B         C  D
2019-01-01  0.000000  0.000000  0.893566  5
2019-01-02  1.244767 -1.265866 -0.402773  5
2019-01-03  0.092322 -0.379152  0.577408  5
2019-01-04 -1.511079 -0.176840 -3.416331  5
2019-01-05 -0.400668  1.216437  0.056223  5
2019-01-06  1.768543 -0.399415 -0.738520  5

In [20]:
#Copy DataFrame object into DataFrame2 object
data_frame2 = data_frame.copy()

In [21]:
#Set all values greater than zero in dataframe2 object to (- data_frame2)
data_frame2[data_frame2>0] = -data_frame2

In [22]:
#Display DataFrame2 object
data_frame2

                   A         B         C  D
2019-01-01  0.000000  0.000000 -0.893566 -5
2019-01-02 -1.244767 -1.265866 -0.402773 -5
2019-01-03 -0.092322 -0.379152 -0.577408 -5
2019-01-04 -1.511079 -0.176840 -3.416331 -5
2019-01-05 -0.400668 -1.216437 -0.056223 -5
2019-01-06 -1.768543 -0.399415 -0.738520 -5

In [25]:
#Reindex data_frame1 with dates from rows 1 - 5, the existing columns, plus new column E
data_frame1 = data_frame.reindex(index=dates[0:4], columns=list(data_frame.columns)+['E'])

In [29]:
#Set the first and second row values in column E to one
data_frame1.loc[dates[0]:dates[1], 'E'] = 1

In [30]:
data_frame1

                   A         B         C  D    E
2019-01-01  0.000000  0.000000  0.893566  5  1.0
2019-01-02  1.244767 -1.265866 -0.402773  5  1.0
2019-01-03  0.092322 -0.379152  0.577408  5  NaN
2019-01-04 -1.511079 -0.176840 -3.416331  5  NaN

In [31]:
#Drop rows in dataframe1 containing missing values in any of the columns
data_frame1.dropna(how='any')

                   A         B         C  D    E
2019-01-01  0.000000  0.000000  0.893566  5  1.0
2019-01-02  1.244767 -1.265866 -0.402773  5  1.0

In [32]:
#Recode missing values to value of 5
data_frame1.fillna(value=5)

                   A         B         C  D    E
2019-01-01  0.000000  0.000000  0.893566  5  1.0
2019-01-02  1.244767 -1.265866 -0.402773  5  1.0
2019-01-03  0.092322 -0.379152  0.577408  5  5.0
2019-01-04 -1.511079 -0.176840 -3.416331  5  5.0

In [33]:
#Check for missing values and return True or False
pd.isna(data_frame1)

                A      B      C      D      E
2019-01-01  False  False  False  False  False
2019-01-02  False  False  False  False  False
2019-01-03  False  False  False  False   True
2019-01-04  False  False  False  False   True

In [34]:
#Return the mean value in all columns
data_frame.mean()

A    0.198981
B   -0.167473
C   -0.505071
D    5.000000
dtype: float64

In [35]:
#Return the mean value in column A
data_frame.mean(1)

2019-01-01    1.473391
2019-01-02    1.144032
2019-01-03    1.322645
2019-01-04   -0.026063
2019-01-05    1.467998
2019-01-06    1.407652
Freq: D, dtype: float64

In [36]:
#Create a new series using numpy to fill in missing values, indexed by dates shifting the index by two periods
new_series = pd.Series([1,3,5, np.nan, 6,8], index=dates).shift(2)

In [46]:
#subtract new_series values from the dataframe object
data_frame.sub(new_series, axis='index')

                   A         B         C    D
2019-01-01       NaN       NaN       NaN  NaN
2019-01-02       NaN       NaN       NaN  NaN
2019-01-03 -0.907678 -1.379152 -0.422592  4.0
2019-01-04 -4.511079 -3.176840 -6.416331  2.0
2019-01-05 -5.400668 -3.783563 -4.943777  0.0
2019-01-06       NaN       NaN       NaN  NaN

In [49]:
#use numpy and apply function to calculate the cumulative sum of each column
data_frame.apply(np.cumsum)

                   A         B         C   D
2019-01-01  0.000000  0.000000  0.893566   5
2019-01-02  1.244767 -1.265866  0.490793  10
2019-01-03  1.337089 -1.645018  1.068202  15
2019-01-04 -0.173990 -1.821858 -2.348130  20
2019-01-05 -0.574659 -0.605421 -2.291907  25
2019-01-06  1.193884 -1.004837 -3.030427  30

In [50]:
#use lambda and apply function to calculate the difference between the max and min of x for each column
data_frame.apply(lambda x: x.max() - x.min())

A    3.279622
B    2.482303
C    4.309897
D    0.000000
dtype: float64

In [51]:
#Create a new series of 10 indexed values (starting at zero) between 0 and 7 (6)
new_series = pd.Series(np.random.randint(0,7, size=10))

In [52]:
new_series

0    3
1    0
2    6
3    6
4    1
5    4
6    0
7    5
8    2
9    5
dtype: int32

In [70]:
#Create a series containing strings
new_series = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [71]:
#Title Case
new_series.str.title()

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    Caba
7     Dog
8     Cat
dtype: object

In [72]:
#Upper Case
new_series.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

In [73]:
#Lower Case
new_series.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [74]:
#Generate new dataframe with random numpy integers
data_frame = pd.DataFrame(np.random.randn(10, 4))

In [75]:
data_frame

          0         1         2         3
0 -0.329079  1.182510  0.432781 -0.555050
1  0.162578 -0.775229 -0.888423  0.150560
2  1.518460 -0.179861  0.529662 -2.020166
3 -1.254087 -0.236411  0.303745  0.339692
4 -0.904049  0.237649 -0.195946  1.212039
5  0.935007 -0.940444 -0.396582  1.193070
6 -0.267587 -0.654678 -0.106629  0.612476
7 -0.597486  0.547825 -1.392847  0.321578
8 -0.351057  0.911293 -0.143490 -1.488609
9  0.623595  0.115610 -0.078414  0.262129

In [85]:
#Generate an object containing parts of dataframe
parts = [data_frame[:3],  data_frame[3:7], data_frame[7:]]

In [86]:
#Concat range object
pd.concat(parts)

          0         1         2         3
0 -0.329079  1.182510  0.432781 -0.555050
1  0.162578 -0.775229 -0.888423  0.150560
2  1.518460 -0.179861  0.529662 -2.020166
3 -1.254087 -0.236411  0.303745  0.339692
4 -0.904049  0.237649 -0.195946  1.212039
5  0.935007 -0.940444 -0.396582  1.193070
6 -0.267587 -0.654678 -0.106629  0.612476
7 -0.597486  0.547825 -1.392847  0.321578
8 -0.351057  0.911293 -0.143490 -1.488609
9  0.623595  0.115610 -0.078414  0.262129

In [89]:
parts = [data_frame[:3],  data_frame[7:]]

In [88]:
#Rows 3 - 6 are missing
pd.concat(pieces)

          0         1         2         3
0 -0.329079  1.182510  0.432781 -0.555050
1  0.162578 -0.775229 -0.888423  0.150560
2  1.518460 -0.179861  0.529662 -2.020166
7 -0.597486  0.547825 -1.392847  0.321578
8 -0.351057  0.911293 -0.143490 -1.488609
9  0.623595  0.115610 -0.078414  0.262129

In [91]:
#left object dictionary dataframe with values 1,2 with the same dict key
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1,2]})

In [92]:
#right object dictionary dataframe with values 4,5 with the same dict key
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval':[4,5]})

In [93]:
left

   key  lval
0  foo     1
1  foo     2

In [94]:
right

   key  rval
0  foo     4
1  foo     5

In [82]:
#Merge both the left right objects together, matching on key
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [100]:
#Define left2 object with different dictionary keys
left2 = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

In [101]:
#Define right2 object with different dictionary keys
right2 = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4,5]})

In [102]:
left

   key  lval
0  foo     1
1  bar     2

In [103]:
right

   key  rval
0  foo     4
1  bar     5

In [106]:
#Merge the two tables together on key
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [117]:
#Create a 8 by 4 dataframe object from random numpy numbers and columns labeled A - D
data_frame = pd.DataFrame(np.random.randn(8,4), columns=['A', 'B', 'C', 'D'])
data_frame

          A         B         C         D
0 -0.464150  1.159781  0.230530  0.041786
1  0.629584 -0.356662  1.138358  0.439996
2 -0.574882 -1.234643  0.491369 -0.906986
3 -0.788064 -0.855062  0.567493 -0.775903
4  0.890111 -0.769811 -0.449902 -1.514317
5  0.427082  2.201430 -0.243384  0.169364
6  0.092758 -1.632013 -1.537818 -0.234461
7 -0.930874  2.688348 -0.300998  1.726515

In [118]:
#list values in third row in all columns
data_frame.iloc[3]

A   -0.788064
B   -0.855062
C    0.567493
D   -0.775903
Name: 3, dtype: float64

In [124]:
#Append new_series to data_frame ignoring index
data_frame.append(new_series, ignore_index=True)

,A,B,C,D,0,1,2,3,4,5,6,7,8
0,foo,one,0.410153,1.614064,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,bar,one,1.122632,0.941896,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,foo,two,-0.793202,1.866327,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,bar,three,-0.883435,-1.038996,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,foo,two,1.249388,-0.755372,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,bar,two,0.400154,-2.235132,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,foo,one,-2.266596,-0.305542,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,foo,three,0.619397,-0.378573,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,A,B,C,Aaba,Baca,NaN,CABA,dog,cat